<script>
import {defineComponent} from 'vue'
import SNewsItem from "@/components/SNewsItem.vue";

export default defineComponent({
  name: "NewsView",
  components: {SNewsItem}
})
</script>

<template>
  <w-card
      title="Новости"
      class="ma4"
      bg-color="base-bg-color"
  >
    <w-flex column gap="4">
      <s-news-item title="Изменения в новой версии 1.3" date="01.09.2023">
        <li>Исправлены ошибки с отображением заявок между отделениями (Для ИТ-специалистов)</li>
        <li>Добавлены новые категории проблем: "Интернет", "Локальная сеть", "Прочее программное обеспечение"</li>
        <li>Добавлена кнопка обновления заявок на странице "Заявки"</li>
        <li>Добавлена кнопка обновления заявок на странице "Пользователи" (Для ИТ-специалистов)</li>
        <li>Добавлен поиск и фильтрация заявок</li>
        <li>Добавлен поиск и фильтрация пользователей (Для ИТ специалистов)</li>
        <li>Добавлена возможность отключить отображение закрытых заявок</li>
        <li>Изменена сортировка по умолчанию в таблице заявок</li>
        <li>Добавлена проверка доступности логина при создании и редактировании пользователя (Для ИТ-специалистов)</li>
        <li>Добавлена возможность смены пароля в профиле</li>
        <li>Исправлено отображение времени в заявках</li>
        <li>Исправлены ошибки отображения заявок между отделениями</li>
      </s-news-item>
      <s-news-item title="Изменения в новой версии 1.2" date="28.08.2023">
        <li>Добавлена прокрутка заявок</li>
        <li>Сортировка по умолчанию теперь по статусу заявки, закрытые в конце</li>
        <li>Добавлена возможность внести Telegram ChatId в свой профиль (Только для ИТ-специалистов)</li>
        <li>Добавлена возможность получать уведомления о новых заявках в Telegram (Только для ИТ-специалистов)</li>
        <li>Исправлены мелкие ошибки</li>
      </s-news-item>
    </w-flex>
  </w-card>
</template>

<style scoped>

</style>